[
  {
    "id": "apex-hub-just-landed",
    "title": "Apex Hub Just Landed",
    "writer": "Erin Deetlefs",
    "background": "url(/alnessie.png)",
    "date": "24th April 2023",
    "contents": [
      "Attention all gamers, content creators, and Apex Legends enthusiasts! We are thrilled to unveil our brand new website, the ultimate hub for everything related to the adrenaline-pumping world of Apex Legends. Strap yourselves in and get ready for a wild ride as we dive into the features of the site.",
      "Firstly, let's talk about our Discord channel. Picture this: a bustling virtual hangout where Legends from all corners of the continent gather to host tournaments and customs. By joining our Discord community, you gain instant access to a treasure trove of camaraderie, which allows you to connect with fellow players and find squads for sweaty matches. Think of it as your personal Apex Legends army at your fingertips.",
      "Now, about the Twitter page that will keep you plugged into all the latest Apex Legends Africa news, updates, and sick plays. Be the first to know about upcoming events, patch notes, and exciting surprises from Respawn Entertainment. Engage with our dynamic community, retweet those epic moments, and join in on the conversations that make the Apex Legends community so incredibly vibrant. You won't want to miss a single tweet! Don’t forget to follow for a chance for your clip to be featured.",
      "But wait, there's more! Our YouTube channel is an unmissable destination for content creators and aspiring stars. Have you ever pulled off an unbelievable triple kill, landed an insane trickshot, or simply want to share your gaming journey with the world? Well, this is your chance to shine! Upload your clips and videos to our clip submission portal. These will then be compiled and uploaded to our YouTube channel. Gain exposure like never before. Join a likeminded community of talented creators/memers who are just as passionate about Apex Legends as you are.",
      "Now introducing the 'Clip of the Week' feature! This is your golden opportunity to showcase your most epic moments and be featured prominently on our website for all to see. Imagine the rush of seeing your name in lights as the community marvels at your meta skills. It's the ultimate validation for your hard work and dedication to the game.",
      "So, what are you waiting for? Join our Discord channel, follow us on Twitter, and subscribe to our YouTube channel to become part of a community that lives and breathes Apex Legends. Gain exposure, make friends, and share your gaming journey with the Apex Hub Africa. Together, we'll create memories that will go down in gaming history.",
      "Buckle up, Legends, because this is just the beginning. Stay tuned to our website for the latest news, updates, and mind-blowing plays from the Apex Legends universe. The stage is set, the curtain has risen, and the spotlight is on you. It's time to make your mark and become a legend in your own right. Let the games begin!"
    ]
  },
  {
    "id": "s17-arsenal",
    "title": "Season 17: Arsenal",
    "writer": "Erin Deetlefs",
    "background": "url(/harvester.png)",
    "date": "9th May 2023",
    "contents": [
      "Get ready, Legends, because it's time to lock and load for the explosive arrival of Apex Legends Season 17: Arsenal! This latest season is like a fireworks display of new content, bringing a whole arsenal of goodies to spice up your gameplay. From a blazing new legend to major map changes, get ready to dive into the chaos and come out on top!",
      "Let's kick things off with the new star of the show: Ballistic, the newest legend in town. This guy is all about dealing serious damage and making sure his enemies feel the heat. With his passive ability, Weapon Sling, Ballistic can store up to three weapons, and when he unleashes his tactical ability, Whistler, enemy weapons will burn up and overheat in their hands. But wait, there's more! His ultimate ability, Weapon Enhancer, lets him and his team rain down unlimited gunfire for the duration.",
      "Now, let's talk about the hot changes happening in the World's Edge map. Get ready to explore the thrilling new addition called Stacks. This massive industrial complex is the place to be if you're hungry for some sweet loot and powerful weapons. In addition to this, respawn has cranked up the excitement even more with new ziplines, jump towers, and some farewell waves to old points of interest. It's time to adapt, strategize, and conquer the new challenges that await!",
      "Season 17 also introduces a new Firing Range where you can test out all the shiny new weapons and hone your skills. Plus, there's a brand-new Weapon Mastery system that rewards you for mastering specific weapons. Show off your expertise and unleash a hailstorm of bullets with style! And let's not forget the revamped Ranked system, designed to bring out the competitive beast in all of us. It's time to climb those ranks and leave your opponents in the dust!",
      "So, how will all these additions impact your gaming experience? Well, Ballistic's explosive abilities will shake up the meta and give you a whole new arsenal of strategies. The changes to World's Edge will challenge your navigational skills and keep you on your toes. And with the new features like the Firing Range, Weapon Mastery system, and Ranked overhaul, you'll have more tools than ever to dominate the battlefield.",
      "Season 17 is an absolute game-changer, my fellow Legends. It's an update that will keep you on the edge of your seat, hungry for more action. If you're a true fan of Apex Legends, you can't afford to miss out on all the incredible content that awaits you in this explosive new season. So, gather your squad, gear up, and get ready to leave your mark on the battlefield.",
      "Stay tuned to our website for all the latest news, updates, and insider tips on Apex Legends Season 17: Arsenal. It's time to show the Outlands what you're made of."
    ]
  }
]
